---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsSupportTrimSupportUpper
source: html/51aa9a1b-2d66-e2df-71a2-a9de33095820.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsSupportTrimSupportUpper Property

"Trim Support at Upper": Trim Support at Upper

## Syntax (C#)
```csharp
public static ForgeTypeId StairsSupportTrimSupportUpper { get; }
```